app/controllers/articles_controller.rb

  def create
    #render plain: params[:article].inspect
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "hello"], ["text", "world\r\n"], ["created_at", "2017-07-13 01:00:50.666007"], ["updated_at", "2017-07-13 01:00:50.666007"]]